[{"id":1417207904666,"title":"课题一：利用深度学习动态调整交易策略","content":"课题背景：AlphaGo是一款基于“深度学习”的围棋程序，其利用高性能计算机，对于大量的围棋“样本”进行学习，构建如同黑盒一般的决策网络，进而对于实战中对手的每一步棋，都给予经过整个网络后的决策结果。\n2016年3月，AlphaGo以4：1战胜职业九段李世石。\n2016年末至2017年初，新马甲Master与中日韩众多高手对决，连续60局而无一败。\n痴迷于此项科技成果的交易员Q，希望在他的交易策略中也能够引入类似“学习”的概念，来帮助他实现自动更新市场认知，动态调整交易策略的想法。\n请提交解决方案： \n1.\t你的最终呈现应至少包含：一份清晰阐述你算法过程、测试结果、分析方法的报告书，一份可供使用的程序代码及简要使用说明（不限定语言或软件）。\n2.\t你的结果好坏并不为交易员Q所看重，但是你的决策想法、思考维度，你的训练过程、分析方式将至关重要！\n附件1.1为某一金融标的在历史上的价格数据，这是你必须使用的。\n附件1.2提供了一些可供参考的市场指标数据历史值。你可以自由选择是否使用，这没有任何关系！","date":"2017-05-03T02:50:50.959Z"},{"id":1417204504666,"title":"课题二：基于图像识别的经济活动预测","content":"课题背景：候选人使用卫星地图等原始数据（不少于10张），从图像中识别出人流、货运、基础设施、环境保护等信息，基于抽取的一类信息，或多类信息，设计经济活动的有关代理变量，并研究这些变量对相关经济活动的预测性。\n请提交解决方案：候选人需要提交的内容包括：\n（1）解决方案的说明文档(包括：研究中使用的原始数据；设计特征识别等大数据分析方法；设计信息提取的规则；设计相关经济活动的代理变量；选择统计模型，检验情绪变量对未来经济活动的预测性；提交分析结果；对分析结果的解读；不多于3000字)；\n（2）所使用的程序代码。","date":"2017-05-03T02:51:20.015Z"},{"id":1417107904666,"title":"课题三：银行间市场的区块链架构设计","content":"课题背景：目前，由于分布式账本的技术逐渐完善，这种去中心化的加密性能好的区块链技术可能会大规模的使用在全球的金融系统中。由于内在的信息共享性质，使得各家银行在数据管理的时候并不希望让自己的客户信息及其敏感交易被竞争对手知晓，并且在监管要求时，能够提供全面的信息给相关机构。如何设计银行间市场的区块链架构并保证各个银行的数据独立性和安全性，请给出您的设计图和相关细节，并论证设计的可行性。 \n请提交解决方案：候选人需要提交解决方案的说明文档(包括：区块链架构的设计图、相关细节、论证设计的可行性；不多于3000字)。","date":"2017-05-03T02:52:01.767Z"},{"id":1417007904666,"title":"课题四： 基于微博爬虫的舆情分析","content":"课题背景： 请设计微博爬虫，获取微博上最近N天(N<=10)内与招商银行相关的热点新闻与用户意见，代码可根据输入的天数返回最新的微博信息。在已收集的数据中对提及的重点内容（招行相关产品、服务和重点事件等）进行抽取并进行一定程度上的情绪判定。最终以浅显易懂的方式呈现该段时间范围内微博上与招行相关的舆情信息，其中呈现的具体内容和方式可由考生自行设计。 \n请提交解决方案：课题需将爬虫构建相关PPT和代码作为研究的最终成果，并在PPT中简要展示以下几点内容： \n（1）构建爬虫和舆情分析的主要流程与模块； \n（2）项目过程中使用到的工具，遇到的困难和问题，以及解决的方式； \n（3）简要评价爬虫的效率与性能； \n（4）最终基于微博信息进行舆情分析的结果展示；","date":"2017-05-03T02:52:42.118Z"},{"id":1416907904666,"title":"课题五：如何利用大数据提升移动支付体验","content":"课题背景：移动支付已经渗透到我们生活的方方面面，在风险可控的前提下提供极致的支付体验，精准了解用户需求并量身定制金融服务，是招商银行一直以来的努力目标。用户在每时每刻的交易过程中留下了大量宝贵的行为数据，如何尽可能捕捉全量数据，快速清洗、分析并在支付交易中加以应用，具有很大的想象空间。\n请提交解决方案：\n（1）招商银行现有移动支付产品（如“一网通支付”“Apple Pay”）流程中，哪些环节可以利用大数据优化和提升体验、为用户及商户创造独特价值？\n（2）选择你认为最重要的1-2个环节，深入阐述具体方案，包括但不限于市场分析、可行性分析、产品方案描述、产品原型展示等。","date":"2017-05-03T02:53:12.246Z"},{"title":"课题六：移动APP研究与实践","content":"课题背景：2016年，招行成功推出手机银行APP5.0，从多个方面实现创新突破，包括运用大数据构建收支应用；基于社交数据推出年度帐单；运用生物识别技术打造安全高效用户体验等等。同时，招行信用卡中心也凭借在掌上生活APP等方面的技术创新，斩获“2016金融科技介甫奖——年度信用卡技术创新奖”。\n请提交解决方案：\n（1）分析招行移动端APP体系（包括手机银行和掌上生活）还有哪些需要改进的地方？如果有，请简要论述改进思路，并分析是否需要引入及如何利用移动新技术？ \n（2）开发一个独立APP，请提交APP安装包作为课题研究成果。开发者可自由选择熟悉的手机平台和开发语言，要求实现如下功能：用户可在手机上编辑文章，并将文章上传到服务器；所有用户均可利用该APP浏览服务器端存储的文章列表；所有用户均可查看文章的具体内容。","date":"2017-05-03T02:53:39.951Z","id":1493780019951}]